# --- Command Line Tools ---
brew "git"
brew "wget"
brew "curl"
brew "zsh"
brew "python"
brew "openjdk"

# --- Package Managers ---
brew "node"
brew "yarn"
brew "gradle"
brew "maven"

# --- Dev Tools ---
cask "visual-studio-code"
cask "android-studio"
cask "docker"
cask "postman"

# --- Mobile Development ---
cask "xcode"              # iOS development
brew "cocoapods"
brew "fastlane"
brew "flutter" 

# --- Utilities ---
cask "iterm2"
cask "google-chrome"
cask "slack"
cask "protonvpn"